_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 46, 46, 64)        1792      
_________________________________________________________________
batch_normalization_1 (Batch (None, 46, 46, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 46, 46, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 44, 62)        26560     
_________________________________________________________________
batch_normalization_2 (Batch (None, 64, 44, 62)        248       
_________________________________________________________________
activation_2 (Activation)    (None, 64, 44, 62)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 42, 60)        36928     
_________________________________________________________________
batch_normalization_3 (Batch (None, 64, 42, 60)        240       
_________________________________________________________________
activation_3 (Activation)    (None, 64, 42, 60)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 21, 30)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 21, 30)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 19, 28)       73856     
_________________________________________________________________
batch_normalization_4 (Batch (None, 128, 19, 28)       112       
_________________________________________________________________
activation_4 (Activation)    (None, 128, 19, 28)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 17, 26)       147584    
_________________________________________________________________
batch_normalization_5 (Batch (None, 128, 17, 26)       104       
_________________________________________________________________
activation_5 (Activation)    (None, 128, 17, 26)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 128, 8, 13)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128, 8, 13)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 13312)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               6816256   
_________________________________________________________________
batch_normalization_6 (Batch (None, 512)               2048      
_________________________________________________________________
activation_6 (Activation)    (None, 512)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 6)                 3078      
_________________________________________________________________
activation_7 (Activation)    (None, 6)                 0         
=================================================================
Total params: 7,109,062
Trainable params: 7,107,558
Non-trainable params: 1,504
_________________________________________________________________
