{"config": [{"config": {"name": "conv2d_1", "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 48, 48, 3], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "filters": 64, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "filters": 64, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "filters": 128, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "filters": 128, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 512, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "batch_normalization_6", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 6, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.2", "backend": "tensorflow"}